/*
 ZEVMS冒险岛(079)游戏服务端
 */
var status = 0;
var beauty = 0;
var New_Face = Array(21031,24024,28000,21078,24001,26096,26054,26854,26024,26095,26095,21044,26023,26022,21031,21078,24710,24711,24712,24713,24714,24715,24716,24717,24718,24719,24720,24721,24722,24723,24724,24725,24726,24727,24728,24729,24730,24731,24732,24735,24736,24737,24738,24739,24740,24741,24750,24751,24752,24753,24754,24755,24756,24757,24758,24759,24760,24761,24762,24763,24764,24766,24767,24768,24769,24770,24771,24772,24773,24774,24775,24777,24778,24779,24780,24781,24782,24787,24788,24790,24797,24798,24801,24802,24804,24807,24809,24810,24811,24812,24813,24814,24815,24816,24817,24819,24820,24822,24824,24825,24826,24828,24829,24830,24831,24832,24835,24836,24837,24850,24852,24853,24854,24855,24856,24857,24858,24859,24860,24861,24863,24864,24868,24869,24870,24871,24872,24873,24877,24878,24879,24881,24882,24887,24888,24890,24897,24898);


var facenew = Array();

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
	if(mode<0){
	cm.dispose();
		
	}
	if(selection<0){
        selection= Math.abs(selection);
     }		
    if (mode == -1)
        cm.dispose();
    else {
        if (mode == 0 && status == 0) {
            cm.dispose();
			cm.openNpc(9900004,'角色美化/整容导航');
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;
        if (status == 0) {
			
			
                  facenew = Array();
                for(var i = 0; i < New_Face.length; i++){
					facenew.push(New_Face[i]);
				}
				cm.sendStyle("选择一个想要的(总共：#r"+New_Face.length+"#k 款脸型)#l", facenew); 

			
			
        } else if (status == 1){			
			
             cm.dispose();
            if (cm.haveItem(5152001) == true){
                cm.gainItem(5152001, -1);
                cm.setFace(facenew[selection]);
                cm.sendOk("你看看还满意吗？");
            }else{
				cm.sendOk("您貌似没有#b#z5152001##k..");
			} 
			
        }	 		

      
    }
}
