/*
 ZEVMS冒险岛(079)游戏服务端
 */
var status = 0;
var beauty = 0;
var New_Face = Array(23500,23501,23502,23503,23504,23505,23506,23508,23510,23511,23512,23513,23514,23515,23516,23517,23518,23519,23520,23521,23523,23524,23525,23526,23527,23528,23529,23530,23531,23532,23533,23534,23535,23538,23539,23540,23541,23542,23543,23544,23553,23554,23555,23556,23557,23558,23559,23560,23561,23562,23563,23564,23565,23566,23567,23568,23569,23570,23571,23572,23573,23574,23575,23576,23577,23578,23579,23580,23581,23582,23583,23584,23586,23592,23594,23599,23600,23601,23602,23603,23604,23605,23606,23608,23610,23611,
23612,23613,23614,23615,23616,23617,23618,23619,23620,23621,23623,23624,23625,23626,23627,23628,23629,23630,23631,23632,23633,23634,23635,23638,23639,23640,23641,23642,23643,23644,23653,23654,23655,23656,23657,23658,23659,23660,23661,23662);


var facenew = Array();

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
	if(mode<0){
	cm.dispose();
		
	}
	if(selection<0){
        selection= Math.abs(selection);
     }		
    if (mode == -1)
        cm.dispose();
    else {
        if (mode == 0 && status == 0) {
            cm.dispose();
			cm.openNpc(9900004,'角色美化/整容导航');
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;
        if (status == 0) {
			
			
                  facenew = Array();
                for(var i = 0; i < New_Face.length; i++){
					facenew.push(New_Face[i]);
				}
				cm.sendStyle("选择一个想要的(总共：#r"+New_Face.length+"#k 款脸型)#l", facenew); 

			
			
        } else if (status == 1){			
			
             cm.dispose();
            if (cm.haveItem(5152001) == true){
                cm.gainItem(5152001, -1);
                cm.setFace(facenew[selection]);
                cm.sendOk("你看看还满意吗？");
            }else{
				cm.sendOk("您貌似没有#b#z5152001##k..");
			} 
			
        }	 		

      
    }
}
